//================================================================================================================================================================
//
//プレイヤーHPゲージ処理[player_hp_gage.h]
//Author : Yuudai Takaya
//
//================================================================================================================================================================
#ifndef _Control_H_
#define _Control_H_

//================================================================================================================================================================
//ライブラリリンク
//================================================================================================================================================================
#include "object2D.h"

//================================================================================================================================================================
//クラス定義
//================================================================================================================================================================

//********************************************タイトル管理クラス****************************************************************
class CControl_Guide :public CObject2D
{
	//-----------------------------------------パブリック----------------------------------------------
public:
	CControl_Guide();
	~CControl_Guide() override;
	HRESULT Init()  override;
	void Uninit()   override;
	void Update()   override;
	void Draw()     override;
	bool GetStart() { return m_bPushStart; }

protected:
	D3DXVECTOR2 m_size;

private:
	bool m_bPushStart;
};

//********************************************Startボタンguide****************************************************************
class CControl_GuideTex :public CControl_Guide
{
	//-----------------------------------------パブリック----------------------------------------------
public:
	CControl_GuideTex();
	~CControl_GuideTex()override;
	HRESULT Init()override;
	void Uninit()override;
	void Update()override;
	void Draw()override;
	static CControl_GuideTex* Create(D3DXVECTOR2 pos); //Object2D生成
};

//********************************************Startボタンguide****************************************************************
class CButton_Guide :public CControl_Guide
{
	//-----------------------------------------パブリック----------------------------------------------
public:
	CButton_Guide();
	~CButton_Guide()override;
	HRESULT Init()override;
	void Uninit()override;
	void Update()override;
	void Draw()override;
	static CButton_Guide* Create(D3DXVECTOR2 pos); //Object2D生成
};

#endif