//================================================================================================================================================================
//
//プレイヤー処理[title.h]
//Author : Yuudai Takaya
//
//================================================================================================================================================================
#ifndef _NOVA_ATK_H_
#define _NOVA_ATK_H_

//================================================================================================================================================================
//ライブラリリンク
//================================================================================================================================================================
#include "Pch.h"
#include "object.h"

//================================================================================================================================================================
//クラス定義
//================================================================================================================================================================

//********************************************レフトfade****************************************************************
class CNova :public CObject
{
	//-----------------------------------------パブリック----------------------------------------------
public:
	CNova();                                       //コンストラクタ
	~CNova() override;		                       //デストラクタ
	HRESULT Init() override;	                       //初期設定
	void Uninit()  override;	                       //終了処理
	void Update()  override;	                       //更新処理
	void Draw()    override;	                       //描画処理
	static CNova* Create(D3DXVECTOR3 pos,float maxsize,int life);		       //空生成

private:
	void HitPlayer();
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;			//頂点バッファ
	LPDIRECT3DTEXTURE9 m_pTexture;				//テクスチャ
	LPDIRECT3DINDEXBUFFER9 m_pidxBuffMeshField = NULL;
	D3DXMATRIX m_mtxWorldMeshfield; //ワールドマトリックス
	D3DXVECTOR3 m_pos;
	D3DXVECTOR3 m_rot;
	float m_size;
	float m_sizepluts;
	float m_fMaxSize;
	int   m_nLife;
	int   m_nAlpha;
};

#endif