//================================================================================================================================================================
//
//オブジェクト3D処理[object3D.cpp]
//Author : Yuudai Takaya
//
//================================================================================================================================================================

//================================================================================================================================================================
//ライブラリリンク
//================================================================================================================================================================
#include "object3d.h"
#include "manager.h"

//================================================================================================================================================================
//コンストラクタ（自分自身の登録）
//================================================================================================================================================================
CObject3D::CObject3D(int nPriority) :CObject(nPriority)
{
	m_pVtxBuff = nullptr;
	m_pTexture = nullptr;
	m_fWidth = 0.0f;
	m_fHeight = 0.0f;
	m_fSplit = 1.0f;
	m_nTime = 0;
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_size = D3DXVECTOR3(0.0f, 0.0f, 0.0f);

	Init();
}

//================================================================================================================================================================
//デストラクタ
//================================================================================================================================================================
CObject3D::~CObject3D()
{

}

//================================================================================================================================================================
//初期設定
//================================================================================================================================================================
HRESULT CObject3D::Init()
{
	m_pVtxBuff = nullptr;
	m_pTexture = nullptr;
	m_fWidth = 0.0f;
	m_fHeight = 0.0f;
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_size = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_bGage = false;
	m_bDraw = true;

	LPDIRECT3DDEVICE9 pDevice;

	pDevice = CManager::GetInstance()->GetRenderer()->GetDevice();

	//頂点バッファの生成
	pDevice->CreateVertexBuffer(sizeof(VERTEX_3D) * 4,
		D3DUSAGE_WRITEONLY,
		FVF_VERTEX_3D,
		D3DPOOL_MANAGED,
		&m_pVtxBuff,
		NULL);

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"",
		&m_pTexture);

	//頂点情報へのポインタ
	VERTEX_3D* pVtx;

	//頂点バッファをロックし、頂点情報へのポインタを取得
	m_pVtxBuff->Lock(0, 0, (void**)&pVtx, 0);

	//頂点座標の設定
	pVtx[0].pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	pVtx[1].pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	pVtx[2].pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	pVtx[3].pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);

	//法線ベクトルの設定
	pVtx[0].nor = D3DXVECTOR3(0.0f, 1.0f, 0.0f);
	pVtx[1].nor = D3DXVECTOR3(0.0f, 1.0f, 0.0f);
	pVtx[2].nor = D3DXVECTOR3(0.0f, 1.0f, 0.0f);
	pVtx[3].nor = D3DXVECTOR3(0.0f, 1.0f, 0.0f);

	//頂点カラーの設定
	pVtx[0].col = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
	pVtx[1].col = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
	pVtx[2].col = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
	pVtx[3].col = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);

	//テクスチャ座標の設定
	pVtx[0].tex = D3DXVECTOR2(0.0f, 0.0f);
	pVtx[1].tex = D3DXVECTOR2(1.0f, 0.0f);
	pVtx[2].tex = D3DXVECTOR2(0.0f, 1.0f);
	pVtx[3].tex = D3DXVECTOR2(1.0f, 1.0f);

	//頂点バッファをアンロックする
	m_pVtxBuff->Unlock();

	return S_OK;
}

//================================================================================================================================================================
//終了処理
//================================================================================================================================================================
void CObject3D::Uninit()
{
	//テクスチャの破棄
	if (m_pTexture != nullptr)
	{
		m_pTexture->Release();
		delete m_pTexture;
		m_pTexture = nullptr;
	}

	//頂点バッファの破棄
	if (m_pVtxBuff != nullptr)
	{
		m_pVtxBuff->Release();
		delete m_pVtxBuff;
		m_pVtxBuff = nullptr;
	}

	Deathflag();
}

//================================================================================================================================================================
//更新処理
//================================================================================================================================================================
void CObject3D::Update()
{
	if (!m_bGage)
	{
		UpdatepVtx();
	}
	else
	{
		UpdateGageVtx();
	}

	UpdateAnim();
}

//================================================================================================================================================================
//テクスチャの設定
//================================================================================================================================================================
void CObject3D::SetTexture(std::string sPath)
{
	LPDIRECT3DDEVICE9 pDevice = CManager::GetInstance()->GetRenderer()->GetDevice();

	// テクスチャの破棄
	if (m_pTexture != nullptr)
	{
		m_pTexture->Release();
		m_pTexture = nullptr;
	}

	//引数のファイルパスを参照してテクスチャ読み込み

	//c_str関数の補足➡NULLで終わる文字配列へのポインタを返す(割と便利ですげぇ)
	D3DXCreateTextureFromFile(pDevice, sPath.c_str(), &m_pTexture);
}

//================================================================================================================================================================
//頂点座標更新処理
//================================================================================================================================================================
void CObject3D::UpdatepVtx()
{
	VERTEX_3D* pVtx;

	// 頂点バッファをロック
	m_pVtxBuff->Lock(0, 0, (void**)&pVtx, 0);

	//頂点座標の指定
	pVtx[0].pos = D3DXVECTOR3(-m_fWidth, 0.0f, m_fHeight);
	pVtx[1].pos = D3DXVECTOR3(m_fWidth, 0.0f, m_fHeight);
	pVtx[2].pos = D3DXVECTOR3(-m_fWidth, 0.0f, -m_fHeight);
	pVtx[3].pos = D3DXVECTOR3(m_fWidth, 0.0f, -m_fHeight);

	//頂点バッファをアンロックする
	m_pVtxBuff->Unlock();
}

//================================================================================================================================================================
//頂点座標更新処理
//================================================================================================================================================================
void CObject3D::UpdateGageVtx()
{
	m_bGage = true;

	VERTEX_3D* pVtx;

	// 頂点バッファをロック
	m_pVtxBuff->Lock(0, 0, (void**)&pVtx, 0);

	//頂点座標の指定
	pVtx[0].pos = D3DXVECTOR3(-m_fWidth, 0.0f, 0.0f);
	pVtx[1].pos = D3DXVECTOR3(m_fWidth, 0.0f, 0.0f);
	pVtx[2].pos = D3DXVECTOR3(-m_fWidth, 0.0f, -m_fHeight * 2.f);
	pVtx[3].pos = D3DXVECTOR3(m_fWidth, 0.0f, -m_fHeight * 2.f);

	//頂点バッファをアンロックする
	m_pVtxBuff->Unlock();
}

//================================================================================================================================================================
//サイズ設定
//================================================================================================================================================================
void CObject3D::SetSize(float fWidth, float fHeight)
{
	m_fHeight = fHeight;
	m_fWidth = fWidth;
}

//================================================================================================================================================================
//サイズ設定
//================================================================================================================================================================
void CObject3D::SetGageSize(float fWidth, float fHeight)
{
	m_bGage = true;
	m_fHeight = fHeight;
	m_fWidth = fWidth;
}

//================================================================================================================================================================
//Object3D座標設定
//================================================================================================================================================================
void CObject3D::SetPos(float x, float y, float z)
{
	m_pos = D3DXVECTOR3(x, y, z);
}

//================================================================================================================================================================
//位置を返す
//================================================================================================================================================================
D3DXVECTOR3* CObject3D::GetPos()
{
	return &m_pos;
}

//================================================================================================================================================================
//方向を返す
//================================================================================================================================================================
D3DXVECTOR3* CObject3D::GetRot()
{
	return &m_rot;
}

//================================================================================================================================================================
//サイズを返す
//================================================================================================================================================================
D3DXVECTOR3* CObject3D::GetSize()
{
	m_size = D3DXVECTOR3(m_fWidth, 0.0f, m_fHeight);

	return &m_size;
}

//================================================================================================================================================================
//アニメーション設定
//================================================================================================================================================================
void CObject3D::SetAnimation(float fSplit, int nTime)
{
	if (fSplit > 0)
	{
		m_fSplit = fSplit;
		m_nTime = nTime;
	}
}

//================================================================================================================================================================
//アニメーションの更新
//================================================================================================================================================================
void CObject3D::UpdateAnim()
{
	VERTEX_3D* pVtx; //頂点情報へのポインタ

	float fSplitSize = 1.0f / m_fSplit;

	// 頂点バッファをロック
	m_pVtxBuff->Lock(0, 0, (void**)&pVtx, 0);

	//テクスチャ座標の設定
	if (m_bRev == true)
	{
		pVtx[0].tex = D3DXVECTOR2(fSplitSize * (float)m_nAnimationId, 0.0f);
		pVtx[1].tex = D3DXVECTOR2(fSplitSize * (float)(m_nAnimationId + 1.0f), 0.0f);
		pVtx[2].tex = D3DXVECTOR2(fSplitSize * (float)m_nAnimationId, 1.0f);
		pVtx[3].tex = D3DXVECTOR2(fSplitSize * (float)(m_nAnimationId + 1.0f), 1.0f);
	}

	else
	{
		m_nextTime++;

		pVtx[0].tex = D3DXVECTOR2(fSplitSize * (float)(m_nAnimationId + 1.0f * -1.f), 0.0f);
		pVtx[1].tex = D3DXVECTOR2(fSplitSize * (float)m_nAnimationId, 0.0f);
		pVtx[2].tex = D3DXVECTOR2(fSplitSize * (float)(m_nAnimationId + 1.0f * -1.f), 1.0f);
		pVtx[3].tex = D3DXVECTOR2(fSplitSize * (float)m_nAnimationId, 1.0f);
	}

	//頂点バッファをアンロックする
	m_pVtxBuff->Unlock();

	// アニメーション進行処理
	{
		if (m_nextTime >= m_nTime)
		{
			m_nAnimationId++;

			m_nextTime = 0;

			if (m_nAnimationId >= m_fSplit)
			{
				m_nAnimationId = 0;
			}
		}
	}
}

//================================================================================================================================================================
//描画するかどうか
//================================================================================================================================================================
void CObject3D::DrawSet(bool DrawSet)
{
	m_bDraw = DrawSet;
}

//================================================================================================================================================================
//描画処理
//================================================================================================================================================================
void CObject3D::Draw()
{
	if (m_bDraw){

		//計算用マトリックス
		D3DXMATRIX mtxRot, mtxTrans;

		CRenderer* pRenderer = nullptr;

		pRenderer = CManager::GetInstance()->GetRenderer();

		LPDIRECT3DDEVICE9 RendererDivice = pRenderer->GetDevice();

		//ワールドマトリックスの初期化
		D3DXMatrixIdentity(&m_mtxWorld);

		//向きを反映
		D3DXMatrixRotationYawPitchRoll(&mtxRot, m_rot.y, m_rot.x, m_rot.z);

		D3DXMatrixMultiply(&m_mtxWorld, &m_mtxWorld, &mtxRot);

		//位置を反映
		D3DXMatrixTranslation(&mtxTrans, m_pos.x, m_pos.y, m_pos.z);

		D3DXMatrixMultiply(&m_mtxWorld, &m_mtxWorld, &mtxTrans);

		//ワールドマトリックスの設定
		RendererDivice->SetTransform(D3DTS_WORLD, &m_mtxWorld);

		//頂点バッファをデータストリームに設定
		RendererDivice->SetStreamSource(0, m_pVtxBuff, 0, sizeof(VERTEX_3D));

		//頂点フォーマットの設定
		RendererDivice->SetFVF(FVF_VERTEX_3D);

		//テクスチャの設定
		RendererDivice->SetTexture(0, m_pTexture);

		//ポリゴン描画
		RendererDivice->DrawPrimitive(D3DPT_TRIANGLESTRIP, 0, 2);//プリミティブの種類
	}
}

//================================================================================================================================================================
//Object3D生成
//================================================================================================================================================================
CObject3D* CObject3D::Create(int nPriority)
{
	CObject3D* pCObject3D = new CObject3D(nPriority);

	pCObject3D->Init();

	return pCObject3D;
}