//=============================================================================
//
// サウンド処理 [sound.h]
// Author : Yuudai Takaya
//
//=============================================================================
#ifndef _SOUND_H_
#define _SOUND_H_

#include "Pch.h"

//================================================================================================================================================================
//クラス定義
//================================================================================================================================================================

class CSound
{
	//-----------------------------------------パブリック----------------------------------------------
public:

	//*****************************************************************************
	// サウンド一覧
	//*****************************************************************************
	typedef enum
	{
		//-----------------------------------------BGM----------------------------------------------
		TITLE_BGM = 0, //タイトルBGM
		TUTORIAL_BGM,  //チュートリアルBGM
		BATTLE_BGM ,   //バトルBGM

		//-----------------------------------------SE----------------------------------------------
		SOUND_ATTACK_SE,    //攻撃時
		SOUND_SQUIRT_SE,    //攻撃時
		SOUND_EXPLOSION_SE, //攻撃時
		SOUND_FIRING_SE,    //攻撃時
		SOUND_LABEL_MAX,
	} SOUND_LABEL;

	HRESULT InitSound(HWND hWnd);
	void UninitSound(void);
	HRESULT PlaySound(SOUND_LABEL label);
	void StopSound(SOUND_LABEL label);
	void StopSound(void);

	//-----------------------------------------プライベート----------------------------------------------
private:
	IXAudio2* m_pXAudio2 = NULL;								// XAudio2オブジェクトへのインターフェイス
	IXAudio2MasteringVoice* m_pMasteringVoice = NULL;			// マスターボイス
	IXAudio2SourceVoice* m_apSourceVoice[SOUND_LABEL_MAX] = {};	// ソースボイス
	BYTE* m_apDataAudio[SOUND_LABEL_MAX] = {};					// オーディオデータ
	DWORD m_aSizeAudio[SOUND_LABEL_MAX] = {};					// オーディオデータサイズ
};
#endif